xzcvczx/mla-legacy/TCPIP WiFi Console Demo App/Alternative Configurations/HardwareProfile PIC32 Starter Kit MRF24WB0M SPI 1.h
//		#define ENC100_SSPBUF			(SPI1BUF)
//		#define ENC100_SPICON1			(SPI1CON)
//		#define ENC100_SPISTATbits		(SPI1STATbits)
//		#define ENC100_SPICON1bits		(SPI1CONbits)
//		#define ENC100_SPIBRG			(SPI1BRG)
//	#endif


//	// 25LC256 I/O pins
//	#if defined(__PIC24FJ256GB110__)
//		// PIC24FJ256GB110 USB PIM has RD12 pin on Explorer 16 schematic 
//		// remapped and actually connected to PIC24FJ256GB110 pin 90 (RG0).  
//		#define EEPROM_CS_TRIS		(TRISGbits.TRISG0)
//		#define EEPROM_CS_IO		(LATGbits.LATG0)
//	#elif defined(__PIC24FJ256GB210__)
//		// PIC24FJ256GB210 USB PIM has RD12 pin on Explorer 16 schematic 
//		// remapped and actually connected to PIC24FJ256GB210 pin 90 (RG0) when 
//		// JP1 on PIM has pins 1-2 shorted (USB).  When JP1 pins 2-3 are shorted 
//		// (PMP), PIC pin 90 does connect to RD12.  To make the PIM work with 
//		// either jumper setting, we will drive both RG0 and RD12 simultaneously
//		// as chip select to the same states.  For an actual application, you'd 
//		// want to specify only the single necessary pin as this double 
//		// assignment operation generates inefficient code by the C compiler.
//		#define EEPROM_CS_TRIS		TRISGbits.TRISG0 = TRISDbits.TRISD12
//		#define EEPROM_CS_IO		LATGbits.LATG0 = LATDbits.LATD12
//	#else
//		#define EEPROM_CS_TRIS		(TRISDbits.TRISD12)
//		#define EEPROM_CS_IO		(LATDbits.LATD12)
//	#endif
//	#define EEPROM_SCK_TRIS		(TRISGbits.TRISG6)
//	#define EEPROM_SDI_TRIS		(TRISGbits.TRISG7)
//	#define EEPROM_SDO_TRIS		(TRISGbits.TRISG8)
//	#if defined(__C30__)	// PIC24F, PIC24H, dsPIC30, dsPIC33
//		#define EEPROM_SPI_IF		(IFS2bits.SPI2IF)
//		#define EEPROM_SSPBUF		(SPI2BUF)
//		#define EEPROM_SPICON1		(SPI2CON1)
//		#define EEPROM_SPICON1bits	(SPI2CON1bits)
//		#define EEPROM_SPICON2		(SPI2CON2)
//		#define EEPROM_SPISTAT		(SPI2STAT)
//		#define EEPROM_SPISTATbits	(SPI2STATbits)
//	#else					// PIC32
//		#define EEPROM_SPI_IF		(IFS1bits.SPI2RXIF)
//		#define EEPROM_SSPBUF		(SPI2BUF)
//		#define EEPROM_SPICON1		(SPI2CON)
//		#define EEPROM_SPICON1bits	(SPI2CONbits)
//		#define EEPROM_SPIBRG		(SPI2BRG)
//		#define EEPROM_SPISTAT		(SPI2STAT)
//		#define EEPROM_SPISTATbits	(SPI2STATbits)
//	#endif


	// LCD Module I/O pins.  NOTE: On the Explorer 16, the LCD is wired to the 
	// same PMP lines required to communicate with an ENCX24J600 in parallel 
	// mode.  Since the LCD does not have a chip select wire, if you are using 
	// the ENC424J600/624J600 in parallel mode, the LCD cannot be used.
	#if !defined(ENC100_INTERFACE_MODE) || (ENC100_INTERFACE_MODE == 0)	// SPI only
		#define LCD_DATA_TRIS		(*((volatile BYTE*)&TRISE))
		#define LCD_DATA_IO			(*((volatile BYTE*)&LATE))
		#define LCD_RD_WR_TRIS		(TRISDbits.TRISD5)
		#define LCD_RD_WR_IO		(LATDbits.LATD5)
		#define LCD_RS_TRIS			(TRISBbits.TRISB15)
		#define LCD_RS_IO			(LATBbits.LATB15)
		#define LCD_E_TRIS			(TRISDbits.TRISD4)
		#define LCD_E_IO			(LATDbits.LATD4)
	#endif


//	// Serial Flash/SRAM/UART PICtail Plus attached to SPI2 (middle pin group)
//  // This daughter card is not in production, but if you custom attach an SPI 
//  // RAM or SPI Flash chip to your board, then use these definitions as a 
//  // starting point.
//	#define SPIRAM_CS_TRIS			(TRISGbits.TRISG9)
//	#define SPIRAM_CS_IO			(LATGbits.LATG9)
//	#define SPIRAM_SCK_TRIS			(TRISGbits.TRISG6)
//	#define SPIRAM_SDI_TRIS			(TRISGbits.TRISG7)
//	#define SPIRAM_SDO_TRIS			(TRISGbits.TRISG8)
//	#if defined(__C30__)	// PIC24F, PIC24H, dsPIC30, dsPIC33
//		#define SPIRAM_SPI_IF			(IFS2bits.SPI2IF)
//		#define SPIRAM_SSPBUF			(SPI2BUF)
//		#define SPIRAM_SPICON1			(SPI2CON1)
//		#define SPIRAM_SPICON1bits		(SPI2CON1bits)
//		#define SPIRAM_SPICON2			(SPI2CON2)
//		#define SPIRAM_SPISTAT			(SPI2STAT)
//		#define SPIRAM_SPISTATbits		(SPI2STATbits)
//	#else					// PIC32
//		#define SPIRAM_SPI_IF			(IFS1bits.SPI2RXIF)
//		#define SPIRAM_SSPBUF			(SPI2BUF)
//		#define SPIRAM_SPICON1			(SPI2CON)
//		#define SPIRAM_SPICON1bits		(SPI2CONbits)
//		#define SPIRAM_SPIBRG			(SPI2BRG)
//	#endif
//
//	// NOTE: You must also set the SPI_FLASH_SST/SPI_FLASH_SPANSION, 
//	//       SPI_FLASH_SECTOR_SIZE, and SPI_FLASH_PAGE_SIZE macros in 
//	//       SPIFlash.h to match your particular Flash memory chip!!!
//	#define SPIFLASH_CS_TRIS		(TRISBbits.TRISB8)
//	#define SPIFLASH_CS_IO			(LATBbits.LATB8)
//	#define SPIFLASH_SCK_TRIS		(TRISGbits.TRISG6)
//	#define SPIFLASH_SDI_TRIS		(TRISGbits.TRISG7)
//	#define SPIFLASH_SDI_IO			(PORTGbits.RG7)
//	#define SPIFLASH_SDO_TRIS		(TRISGbits.TRISG8)
//	#if defined(__C30__)	// PIC24F, PIC24H, dsPIC30, dsPIC33
//		#define SPIFLASH_SPI_IF			(IFS2bits.SPI2IF)
//		#define SPIFLASH_SSPBUF			(SPI2BUF)
//		#define SPIFLASH_SPICON1		(SPI2CON1)
//		#define SPIFLASH_SPICON1bits	(SPI2CON1bits)
//		#define SPIFLASH_SPICON2		(SPI2CON2)
//		#define SPIFLASH_SPISTAT		(SPI2STAT)
//		#define SPIFLASH_SPISTATbits	(SPI2STATbits)
//	#else					// PIC32
//		#define SPIFLASH_SPI_IF			(IFS1bits.SPI2RXIF)
//		#define SPIFLASH_SSPBUF			(SPI2BUF)
//		#define SPIFLASH_SPICON1		(SPI2CON)
//		#define SPIFLASH_SPICON1bits	(SPI2CONbits)
//		#define SPIFLASH_SPISTATbits	(SPI2STATbits)
//		#define SPIFLASH_SPIBRG			(SPI2BRG)
//	#endif

    //----------------------------
    // MRF24WB0M WiFi I/O pins
    //----------------------------
	// If you have a MRF24WB0M WiFi PICtail, you must uncomment one of 
	// these two lines to use it.  SPI1 is the top-most slot in the Explorer 16 
	// (closer to the LCD and prototyping area) while SPI2 corresponds to 
	// insertion of the PICtail into the middle of the side edge connector slot.
	#define MRF24WB0M_IN_SPI1
	//#define MRF24WB0M_IN_SPI2
	
	// PIC24FJ256GA110 PIM on Explorer 16 must use SPI2, not SPI1
	#if defined(MRF24WB0M_IN_SPI1) && defined(__PIC24FJ256GA110__)
		#undef MRF24WB0M_IN_SPI1
		#define MRF24WB0M_IN_SPI2
	#endif

    #if defined( MRF24WB0M_IN_SPI1 ) && !defined(__32MX460F512L__) && !defined(__32MX795F512L__) && !defined(__PIC24FJ256GA110__)
        // MRF24WB0M in SPI1 slot
        #define WF_CS_TRIS			(TRISBbits.TRISB2)
    	#define WF_CS_IO			(LATBbits.LATB2)
    	#define WF_SDI_TRIS			(TRISFbits.TRISF7)
    	#define WF_SCK_TRIS			(TRISFbits.TRISF6)
    	#define WF_SDO_TRIS			(TRISFbits.TRISF8)
      	#define WF_RESET_TRIS		(TRISFbits.TRISF0)
    	#define WF_RESET_IO			(LATFbits.LATF0)
        #if defined(__dsPIC33FJ256GP710__) || defined(__PIC24HJ256GP610__)
			#define WF_INT_TRIS	    (TRISAbits.TRISA12)
			#define WF_INT_IO		(PORTAbits.RA12)
        #else
			#define WF_INT_TRIS	    (TRISEbits.TRISE8)  // INT1
			#define WF_INT_IO		(PORTEbits.RE8)
        #endif
    	#define WF_HIBERNATE_TRIS	(TRISFbits.TRISF1)
    	#define	WF_HIBERNATE_IO		(PORTFbits.RF1)
    	#if defined( __C30__ )
            #define WF_INT_EDGE		    (INTCON2bits.INT1EP)
        	#define WF_INT_IE			(IEC1bits.INT1IE)
        	#define WF_INT_IF			(IFS1bits.INT1IF)
    	#elif defined( __PIC32MX__ )
            #define WF_INT_EDGE		    (INTCONbits.INT1EP)
        	#define WF_INT_IE			(IEC0bits.INT1IE)
        	#define WF_INT_IF			(IFS0bits.INT1IF)
        	#define WF_INT_IE_CLEAR     IEC0CLR
        	#define WF_INT_IF_CLEAR     IFS0CLR
        	#define WF_INT_IE_SET       IEC0SET
        	#define WF_INT_IF_SET       IFS0SET
        	#define WF_INT_BIT          0x00000080
        	#define WF_INT_IPCSET       IPC1SET
        	#define WF_INT_IPCCLR       IPC1CLR
        	#define WF_INT_IPC_MASK     0xFF000000
        	#define WF_INT_IPC_VALUE    0x0C000000
        #else
            #error Determine MRF24WB0M external interrupt
        #endif

