xzcvczx/mla-legacy/TCPIP WiFi Console Demo App/Alternative Configurations/HardwareProfile PIC32 Starter Kit MRF24WB0M SPI 1.h
    	#define WF_SSPBUF			(SPI1BUF)
    	#define WF_SPISTAT			(SPI1STAT)
    	#define WF_SPISTATbits		(SPI1STATbits)
    	#if defined( __C30__ )
        	#define WF_SPICON1			(SPI1CON1)
        	#define WF_SPICON1bits		(SPI1CON1bits)
        	#define WF_SPICON2			(SPI1CON2)
        	#define WF_SPI_IE			(IEC0bits.SPI1IE)
    //    	#define WF_SPI_IP			(IPC2bits.SPI1IP)
        	#define WF_SPI_IF			(IFS0bits.SPI1IF)
        #elif defined( __PIC32MX__ )
        	#define WF_SPICON1			(SPI1CON)
        	#define WF_SPICON1bits		(SPI1CONbits)
            #define WF_SPI_IE_CLEAR     IEC0CLR
            #define WF_SPI_IF_CLEAR     IFS0CLR
            #define WF_SPI_INT_BITS     0x03800000
    		#define WF_SPI_BRG		    (SPI1BRG)
            #define WF_MAX_SPI_FREQ     (10000000ul)	// Hz
        #else
            #error Determine MRF24WB0M SPI information
        #endif
        
    #elif defined( MRF24WB0M_IN_SPI2 ) && !defined(__32MX460F512L__) && !defined(__32MX795F512L__)
        // MRF24WB0M in SPI2 slot
        #define WF_CS_TRIS			(TRISGbits.TRISG9)
    	#define WF_CS_IO			(LATGbits.LATG9)
    	#define WF_SDI_TRIS			(TRISGbits.TRISG7)
    	#define WF_SCK_TRIS			(TRISGbits.TRISG6)
    	#define WF_SDO_TRIS			(TRISGbits.TRISG8)
      	#define WF_RESET_TRIS		(TRISGbits.TRISG0)
    	#define WF_RESET_IO			(LATGbits.LATG0)
		#if defined(__PIC24FJ256GB110__) || defined(__PIC24FJ256GB210__)
			#define WF_INT_TRIS		    (TRISCbits.TRISC3)	// INT3
			#define WF_INT_IO			(PORTCbits.RC3)
		#else
			#define WF_INT_TRIS		    (TRISAbits.TRISA14)	// INT3
			#define WF_INT_IO			(PORTAbits.RA14)
		#endif
    	#define WF_HIBERNATE_TRIS	    (TRISGbits.TRISG1)
    	#define	WF_HIBERNATE_IO			(PORTGbits.RG1)
    	#if defined( __C30__ )
            #define WF_INT_EDGE		    (INTCON2bits.INT3EP)
        	#define WF_INT_IE			(IEC3bits.INT3IE)
        	#define WF_INT_IF			(IFS3bits.INT3IF)
    	#elif defined( __PIC32MX__ )
            #define WF_INT_EDGE		    (INTCONbits.INT3EP)
        	#define WF_INT_IE			(IEC0bits.INT3IE)
        	#define WF_INT_IF			(IFS0bits.INT3IF)
        	#define WF_INT_IE_CLEAR     IEC0CLR
        	#define WF_INT_IF_CLEAR     IFS0CLR
        	#define WF_INT_IE_SET       IEC0SET
        	#define WF_INT_IF_SET       IFS0SET
        	#define WF_INT_BIT          0x00008000
        	#define WF_INT_IPCSET       IPC3SET
        	#define WF_INT_IPCCLR       IPC3CLR
        	#define WF_INT_IPC_MASK     0xFF000000
        	#define WF_INT_IPC_VALUE    0x0C000000
        #else
            #error Determine MRF24WB0M external interrupt
        #endif
        
    	#define WF_SSPBUF			(SPI2BUF)
    	#define WF_SPISTAT			(SPI2STAT)
    	#define WF_SPISTATbits		(SPI2STATbits)
    	#if defined( __C30__ )
        	#define WF_SPICON1			(SPI2CON1)
        	#define WF_SPICON1bits		(SPI2CON1bits)
        	#define WF_SPICON2			(SPI2CON2)
        	#define WF_SPI_IE			(IEC2bits.SPI2IE)
    //    	#define WF_SPI_IP			(IPC8bits.SPI2IP)
        	#define WF_SPI_IF			(IFS2bits.SPI2IF)
        #elif defined( __PIC32MX__ )
        	#define WF_SPICON1			(SPI2CON)
        	#define WF_SPICON1bits		(SPI2CONbits)
            #define WF_SPI_IE_CLEAR     IEC1CLR
            #define WF_SPI_IF_CLEAR     IFS1CLR
            #define WF_SPI_INT_BITS     0x000000e0
    		#define WF_SPI_BRG		    (SPI2BRG)
            #define WF_MAX_SPI_FREQ     (10000000ul)	// Hz
        #else
            #error Determine MRF24WB0M SPI information
        #endif

	#elif defined( MRF24WB0M_IN_SPI1 ) && (defined(__32MX460F512L__) || defined(__32MX795F512L__))
        // MRF24WB0M in SPI1 slot
        #define WF_CS_TRIS			(TRISDbits.TRISD9)
    	#define WF_CS_IO			(LATDbits.LATD9)
    	#define WF_SDI_TRIS			(TRISCbits.TRISC4)
    	#define WF_SCK_TRIS			(TRISDbits.TRISD10)
    	#define WF_SDO_TRIS			(TRISDbits.TRISD0)
      	#define WF_RESET_TRIS		(TRISFbits.TRISF0)
    	#define WF_RESET_IO			(LATFbits.LATF0)
    	#define WF_INT_TRIS		    (TRISEbits.TRISE8)  // INT1
    	#define WF_INT_IO			(PORTEbits.RE8)
    	#define WF_HIBERNATE_TRIS	(TRISFbits.TRISF1)
    	#define WF_HIBERNATE_IO		(PORTFbits.RF1)
    	#if defined( __C30__ )
            #define WF_INT_EDGE		    (INTCON2bits.INT1EP)
        	#define WF_INT_IE			(IEC1bits.INT1IE)
        	#define WF_INT_IF			(IFS1bits.INT1IF)
    	#elif defined( __PIC32MX__ )
            #define WF_INT_EDGE		    (INTCONbits.INT1EP)
        	#define WF_INT_IE			(IEC0bits.INT1IE)
        	#define WF_INT_IF			(IFS0bits.INT1IF)
        	#define WF_INT_IE_CLEAR     IEC0CLR
        	#define WF_INT_IF_CLEAR     IFS0CLR
        	#define WF_INT_IE_SET       IEC0SET
        	#define WF_INT_IF_SET       IFS0SET
        	#define WF_INT_BIT          0x00000080
        	#define WF_INT_IPCSET       IPC1SET
        	#define WF_INT_IPCCLR       IPC1CLR
        	#define WF_INT_IPC_MASK     0xFF000000
        	#define WF_INT_IPC_VALUE    0x0C000000
        #else
            #error Determine MRF24WB0M external interrupt
        #endif

    	#define WF_SSPBUF			(SPI1BUF)
    	#define WF_SPISTAT			(SPI1STAT)
    	#define WF_SPISTATbits		(SPI1STATbits)
    	#if defined( __C30__ )
        	#define WF_SPICON1			(SPI1CON1)
        	#define WF_SPICON1bits		(SPI1CON1bits)
        	#define WF_SPICON2			(SPI1CON2)
        	#define WF_SPI_IE			(IEC0bits.SPI1IE)
    //    	#define WF_SPI_IP			(IPC2bits.SPI1IP)
        	#define WF_SPI_IF			(IFS0bits.SPI1IF)
        #elif defined( __PIC32MX__ )
        	#define WF_SPICON1			(SPI1CON)
        	#define WF_SPICON1bits		(SPI1CONbits)
            #define WF_SPI_IE_CLEAR     IEC0CLR
            #define WF_SPI_IF_CLEAR     IFS0CLR
            #define WF_SPI_INT_BITS     0x03800000
    		#define WF_SPI_BRG		    (SPI1BRG)
            #define WF_MAX_SPI_FREQ     (10000000ul)	// Hz
        #else
            #error Determine MRF24WB0M SPI information
        #endif
    #elif defined( MRF24WB0M_IN_SPI2 ) && (defined(__32MX460F512L__) || defined(__32MX795F512L__))
    	#error "/RST and /CE are on RG2 and RG3 which are multiplexed with USB D+ and D-."
    #endif

