xzcvczx/mla-legacy/TCPIP WiFi Console Demo App/Alternative Configurations/HardwareProfile PIC32 Starter Kit MRF24WB0M SPI 1.h
#elif defined(DSPICDEM11)
// dsPICDEM 1.1 Development Board + Ethernet PICtail airwired. There 
// is no PICtail header on this development board.  The following 
// airwires must be made:
// 1. dsPICDEM GND <-> PICtail GND (PICtail pin 27)
// 2. dsPICDEM Vdd <- PICtail VPIC (PICtail pin 25)
// 3. dsPICDEM RG2 -> PICtail ENC28J60 CS (PICtail pin 22)
// 4. dsPICDEM RF6 -> PICtail SCK (PICtail pin 11)
// 5. dsPICDEM RF7 <- PICtail SDI (PICtail pin 9)
// 6. dsPICDEM RF8 -> PICtail SDO (PICtail pin 7)
// 7. dsPICDEM RG3 -> PICtail 25LC256 CS (PICtail pin 20)

	#define LED0_TRIS			(TRISDbits.TRISD3)	// Ref LED4
	#define LED0_IO				(PORTDbits.RD3)
	#define LED1_TRIS			(TRISDbits.TRISD2)	// Ref LED3
	#define LED1_IO				(PORTDbits.RD2)
	#define LED2_TRIS			(TRISDbits.TRISD1)	// Ref LED2
	#define LED2_IO				(PORTDbits.RD1)
	#define LED3_TRIS			(TRISDbits.TRISD0)	// Ref LED1
	#define LED3_IO				(PORTDbits.RD0)
	#define LED4_TRIS			(TRISDbits.TRISD3)	// No LED, Remapped to Ref LED4
	#define LED4_IO				(PORTDbits.RD3)
	#define LED5_TRIS			(TRISDbits.TRISD2)	// No LED, Remapped to Ref LED3
	#define LED5_IO				(PORTDbits.RD2)
	#define LED6_TRIS			(TRISDbits.TRISD1)	// No LED, Remapped to Ref LED2
	#define LED6_IO				(PORTDbits.RD1)
	#define LED7_TRIS			(TRISDbits.TRISD0)	// No LED, Remapped to Ref LED1
	#define LED7_IO				(PORTDbits.RD0)
	#define LED_GET()			((LED3_IO<<3) | (LED2_IO<<2) | (LED1_IO<<1) | LED0_IO)
	#define LED_PUT(a)			do{BYTE vTemp = (a); LED0_IO = vTemp&0x1; LED1_IO = vTemp&0x2; LED2_IO = vTemp&0x4; LED3_IO = vTemp&0x8;} while(0)

	#define BUTTON0_TRIS		(TRISAbits.TRISA15)	// Ref SW4
	#define	BUTTON0_IO			(PORTAbits.RA15)
	#define BUTTON1_TRIS		(TRISAbits.TRISA14)	// Ref SW3
	#define	BUTTON1_IO			(PORTAbits.RA14)
	#define BUTTON2_TRIS		(TRISAbits.TRISA13)	// Ref SW2
	#define	BUTTON2_IO			(PORTAbits.RA13)
	#define BUTTON3_TRIS		(TRISAbits.TRISA12)	// Ref SW1
	#define	BUTTON3_IO			(PORTAbits.RA12)

	#define UARTTX_TRIS			(TRISFbits.TRISF3)
	#define UARTTX_IO			(PORTFbits.RF3)
	#define UARTRX_TRIS			(TRISFbits.TRISF2)
	#define UARTRX_IO			(PORTFbits.RF2)

//	// ENC28J60 I/O pins
//	#define ENC_CS_TRIS			(TRISGbits.TRISG2)		// User must airwire this
//	#define ENC_CS_IO			(PORTGbits.RG2)
//	// SPI SCK, SDI, SDO pins are automatically controlled by the 
//	// PIC24/dsPIC/PIC32 SPI module 
//	#define ENC_SPI_IF			(IFS0bits.SPI1IF)
//	#define ENC_SSPBUF			(SPI1BUF)
//	#define ENC_SPICON1			(SPI1CON)
//	#define ENC_SPICON1bits		(SPI1CONbits)
//	#define ENC_SPICON2			(SPI1BUF)				// SPI1CON2 doesn't exist, remap to unimportant register
//	#define ENC_SPISTAT			(SPI1STAT)
//	#define ENC_SPISTATbits		(SPI1STATbits)

//	// 25LC256 I/O pins
//	#define EEPROM_CS_TRIS		(TRISGbits.TRISG3)	// User must airwire this
//	#define EEPROM_CS_IO		(PORTGbits.RG3)
//	#define EEPROM_SCK_TRIS		(TRISGbits.TRISG6)
//	#define EEPROM_SDI_TRIS		(TRISGbits.TRISG7)
//	#define EEPROM_SDO_TRIS		(TRISGbits.TRISG8)
//	#define EEPROM_SPI_IF		(IFS0bits.SPI1IF)
//	#define EEPROM_SSPBUF		(SPI1BUF)
//	#define EEPROM_SPICON1		(SPI1CON)
//	#define EEPROM_SPICON1bits	(SPI1CONbits)
//	#define EEPROM_SPICON2		(SPI1BUF)			// SPI1CON2 doesn't exist, remap to unimportant register
//	#define EEPROM_SPISTAT		(SPI1STAT)
//	#define EEPROM_SPISTATbits	(SPI1STATbits)

	// SI3000 codec pins
	#define CODEC_RST_TRIS		(TRISFbits.TRISF6)
	#define CODEC_RST_IO		(PORTFbits.RF6)
	
	// PIC18F252 LCD Controller
	#define LCDCTRL_CS_TRIS		(TRISGbits.TRISG9)
	#define LCDCTRL_CS_IO		(PORTGbits.RG9)

#elif defined(PICDEMNET2) && !defined(HI_TECH_C)
// PICDEM.net 2 (PIC18F97J60 + ENC28J60 or ENC624J600)

	// I/O pins
	#define LED0_TRIS			(TRISJbits.TRISJ0)
	#define LED0_IO				(LATJbits.LATJ0)
	#define LED1_TRIS			(TRISJbits.TRISJ1)
	#define LED1_IO				(LATJbits.LATJ1)
	#define LED2_TRIS			(TRISJbits.TRISJ2)
	#define LED2_IO				(LATJbits.LATJ2)
	#define LED3_TRIS			(TRISJbits.TRISJ3)
	#define LED3_IO				(LATJbits.LATJ3)
	#define LED4_TRIS			(TRISJbits.TRISJ4)
	#define LED4_IO				(LATJbits.LATJ4)
	#define LED5_TRIS			(TRISJbits.TRISJ5)
	#define LED5_IO				(LATJbits.LATJ5)
	#define LED6_TRIS			(TRISJbits.TRISJ6)
	#define LED6_IO				(LATJbits.LATJ6)
	#define LED7_TRIS			(TRISJbits.TRISJ7)
	#define LED7_IO				(LATJbits.LATJ7)
	#define LED_GET()			(LATJ)
	#define LED_PUT(a)			(LATJ = (a))

	#define BUTTON0_TRIS		(TRISBbits.TRISB3)
	#define	BUTTON0_IO			(PORTBbits.RB3)
	#define BUTTON1_TRIS		(TRISBbits.TRISB2)
	#define	BUTTON1_IO			(PORTBbits.RB2)
	#define BUTTON2_TRIS		(TRISBbits.TRISB1)
	#define	BUTTON2_IO			(PORTBbits.RB1)
	#define BUTTON3_TRIS		(TRISBbits.TRISB0)
	#define	BUTTON3_IO			(PORTBbits.RB0)

//	// ENC424J600/624J600 Fast 100Mbps Ethernet PICtail Plus defines
//	#define ENC100_INTERFACE_MODE			0	// Uncomment this to use the ENC424J600/624J600 Ethernet controller
//
//	// ENC424J600/624J600 Fast 100Mbps Ethernet PICtail Plus I/O pins
//	#define ENC100_MDIX_TRIS				(TRISBbits.TRISB4)
//	#define ENC100_MDIX_IO					(LATBbits.LATB4)
//	#define ENC100_POR_TRIS					(TRISBbits.TRISB5)
//	#define ENC100_POR_IO					(LATBbits.LATB5)
//	#define ENC100_INT_TRIS					(TRISBbits.TRISB2)
//	#define ENC100_INT_IO					(PORTBbits.RB2)
//
//	// ENC424J600/624J600 SPI pinout
//	#define ENC100_CS_TRIS					(TRISBbits.TRISB3)
//	#define ENC100_CS_IO					(LATBbits.LATB3)
//	#define ENC100_SO_WR_B0SEL_EN_TRIS		(TRISCbits.TRISC4)	// NOTE: SO is ENC624J600 Serial Out, which needs to connect to the PIC SDI pin for SPI mode
//	#define ENC100_SO_WR_B0SEL_EN_IO		(PORTCbits.RC4)
//	#define ENC100_SI_RD_RW_TRIS			(TRISCbits.TRISC5)	// NOTE: SI is ENC624J600 Serial In, which needs to connect to the PIC SDO pin for SPI mode
//	#define ENC100_SI_RD_RW_IO				(LATCbits.LATC5)
//	#define ENC100_SCK_AL_TRIS				(TRISCbits.TRISC3)
//	#define ENC100_SCK_AL_IO				(PORTCbits.RC3)		// NOTE: This must be the PORT, not the LATch like it is for the PSP interface.
//
//	// ENC424J600/624J600 SPI SFR register selection (controls which SPI 
//	// peripheral to use on PICs with multiple SPI peripherals).
////	#define ENC100_ISR_ENABLE		(INTCON3bits.INT2IE)
////	#define ENC100_ISR_FLAG			(INTCON3bits.INT2IF)
////	#define ENC100_ISR_POLARITY		(INTCON2bits.INTEDG2)
////	#define ENC100_ISR_PRIORITY		(INTCON3bits.INT2IP)
//	#define ENC100_SPI_ENABLE		(ENC100_SPISTATbits.SPIEN)
//	#define ENC100_SPI_IF			(PIR1bits.SSP1IF)
//	#define ENC100_SSPBUF			(SSP1BUF)
//	#define ENC100_SPISTAT			(SSP1STAT)
//	#define ENC100_SPISTATbits		(SSP1STATbits)
//	#define ENC100_SPICON1			(SSP1CON1)
//	#define ENC100_SPICON1bits		(SSP1CON1bits)
//	#define ENC100_SPICON2			(SSP1CON2)


//	// ENC28J60 I/O pins
//	#define ENC_RST_TRIS		(TRISDbits.TRISD2)	// Not connected by default
//	#define ENC_RST_IO			(LATDbits.LATD2)
//	//#define ENC_CS_TRIS			(TRISDbits.TRISD3)	// Uncomment this line if you wish to use the ENC28J60 on the PICDEM.net 2 board instead of the internal PIC18F97J60 Ethernet module
//	#define ENC_CS_IO			(LATDbits.LATD3)
//	#define ENC_SCK_TRIS		(TRISCbits.TRISC3)
//	#define ENC_SDI_TRIS		(TRISCbits.TRISC4)
//	#define ENC_SDO_TRIS		(TRISCbits.TRISC5)
//	#define ENC_SPI_IF			(PIR1bits.SSP1IF)
//	#define ENC_SSPBUF			(SSP1BUF)
//	#define ENC_SPISTAT			(SSP1STAT)
//	#define ENC_SPISTATbits		(SSP1STATbits)
//	#define ENC_SPICON1			(SSP1CON1)
//	#define ENC_SPICON1bits		(SSP1CON1bits)
//	#define ENC_SPICON2			(SSP1CON2)

    //----------------
    // MRF24WB0M I/O pins
    //----------------
	#define WF_CS_TRIS			(TRISCbits.TRISC2)	// Uncomment this line if you wish to use the MRF24WB0M on the PICDEM.net 2 board instead of the internal PIC18F97J60 Ethernet module
	#define WF_SDI_TRIS			(TRISCbits.TRISC4)
	#define WF_SCK_TRIS			(TRISCbits.TRISC3)
	#define WF_SDO_TRIS			(TRISCbits.TRISC5)
	#define WF_RESET_TRIS		(TRISBbits.TRISB1)
	#define WF_RESET_IO			(LATBbits.LATB1)
	#define WF_INT_TRIS		    (TRISBbits.TRISB0)
	#define WF_INT_IO			(PORTBbits.RB0)
	#define WF_CS_IO			(LATCbits.LATC2)
	#define WF_HIBERNATE_TRIS   (TRISBbits.TRISB2)
	#define	WF_HIBERNATE_IO	    (PORTBbits.RB2)
	#define WF_INT_EDGE		    (INTCON2bits.INTEDG0)
	#define WF_INT_IE			(INTCONbits.INT0IE)
	#define WF_INT_IF			(INTCONbits.INT0IF)
	#define WF_SPI_IF			(PIR1bits.SSPIF)
	#define WF_SSPBUF			(SSP1BUF)
	#define WF_SPISTAT			(SSP1STAT)
	#define WF_SPISTATbits		(SSP1STATbits)
	#define WF_SPICON1			(SSP1CON1)
	#define WF_SPICON1bits		(SSP1CON1bits)
	#define WF_SPICON2			(SSP1CON2)
	#define WF_SPI_IE			(PIE1bits.SSPIE)
	#define WF_SPI_IP			(IPR1bits.SSPIP)

//	// 25LC256 I/O pins
//	#define EEPROM_CS_TRIS		(TRISDbits.TRISD7)
//	#define EEPROM_CS_IO		(LATDbits.LATD7)
//	#define EEPROM_SCK_TRIS		(TRISCbits.TRISC3)
//	#define EEPROM_SDI_TRIS		(TRISCbits.TRISC4)
//	#define EEPROM_SDO_TRIS		(TRISCbits.TRISC5)
//	#define EEPROM_SPI_IF		(PIR1bits.SSP1IF)
//	#define EEPROM_SSPBUF		(SSP1BUF)
//	#define EEPROM_SPICON1		(SSP1CON1)
//	#define EEPROM_SPICON1bits	(SSP1CON1bits)
//	#define EEPROM_SPICON2		(SSP1CON2)
//	#define EEPROM_SPISTAT		(SSP1STAT)
//	#define EEPROM_SPISTATbits	(SSP1STATbits)

	// LCD I/O pins
	#define LCD_DATA_TRIS		(TRISE)
	#define LCD_DATA_IO			(LATE)
	#define LCD_RD_WR_TRIS		(TRISHbits.TRISH1)
	#define LCD_RD_WR_IO		(LATHbits.LATH1)
	#define LCD_RS_TRIS			(TRISHbits.TRISH2)
	#define LCD_RS_IO			(LATHbits.LATH2)
	#define LCD_E_TRIS			(TRISHbits.TRISH0)
	#define LCD_E_IO			(LATHbits.LATH0)

	// Serial Flash/SRAM/UART PICtail
//	#define SPIRAM_CS_TRIS			(TRISBbits.TRISB5)
//	#define SPIRAM_CS_IO			(LATBbits.LATB5)
//	#define SPIRAM_SCK_TRIS			(TRISCbits.TRISC3)
//	#define SPIRAM_SDI_TRIS			(TRISCbits.TRISC4)
//	#define SPIRAM_SDO_TRIS			(TRISCbits.TRISC5)
//	#define SPIRAM_SPI_IF			(PIR1bits.SSPIF)
//	#define SPIRAM_SSPBUF			(SSP1BUF)
//	#define SPIRAM_SPICON1			(SSP1CON1)
//	#define SPIRAM_SPICON1bits		(SSP1CON1bits)
//	#define SPIRAM_SPICON2			(SSP1CON2)
//	#define SPIRAM_SPISTAT			(SSP1STAT)
//	#define SPIRAM_SPISTATbits		(SSP1STATbits)
//
//	// NOTE: You must also set the SPI_FLASH_SST/SPI_FLASH_SPANSION, 
//	//       SPI_FLASH_SECTOR_SIZE, and SPI_FLASH_PAGE_SIZE macros in 
//	//       SPIFlash.h to match your particular Flash memory chip!!!
//	#define SPIFLASH_CS_TRIS		(TRISBbits.TRISB4)
//	#define SPIFLASH_CS_IO			(LATBbits.LATB4)
//	#define SPIFLASH_SCK_TRIS		(TRISCbits.TRISC3)
//	#define SPIFLASH_SDI_TRIS		(TRISCbits.TRISC4)
//	#define SPIFLASH_SDI_IO			(PORTCbits.RC4)
//	#define SPIFLASH_SDO_TRIS		(TRISCbits.TRISC5)
//	#define SPIFLASH_SPI_IF			(PIR1bits.SSPIF)
//	#define SPIFLASH_SSPBUF			(SSP1BUF)
//	#define SPIFLASH_SPICON1		(SSP1CON1)
//	#define SPIFLASH_SPICON1bits	(SSP1CON1bits)
//	#define SPIFLASH_SPICON2		(SSP1CON2)
//	#define SPIFLASH_SPISTAT		(SSP1STAT)
//	#define SPIFLASH_SPISTATbits	(SSP1STATbits)

#elif defined(PICDEMNET2) && defined(HI_TECH_C)
// PICDEM.net 2 (PIC18F97J60 + ENC28J60) + HI-TECH PICC-18 compiler
// Optionally may use Fast 100Mbps Ethernet PICtail Plus (ENC624J600)
	// I/O pins
	#define LED0_TRIS			(TRISJ0)
	#define LED0_IO				(LATJ0)
	#define LED1_TRIS			(TRISJ1)
	#define LED1_IO				(LATJ1)
	#define LED2_TRIS			(TRISJ2)
	#define LED2_IO				(LATJ2)
	#define LED3_TRIS			(TRISJ3)
	#define LED3_IO				(LATJ3)
	#define LED4_TRIS			(TRISJ4)
	#define LED4_IO				(LATJ4)
	#define LED5_TRIS			(TRISJ5)
	#define LED5_IO				(LATJ5)
	#define LED6_TRIS			(TRISJ6)
	#define LED6_IO				(LATJ6)
	#define LED7_TRIS			(TRISJ7)
	#define LED7_IO				(LATJ7)
	#define LED_GET()			(LATJ)
	#define LED_PUT(a)			(LATJ = (a))

